Day18: What do I need to know about the pandas index (Part 2)

In [1]:
import pandas as pd

In [21]:
drinks = pd.read_csv("https://bit.ly/drinksbycountry")

In [22]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [23]:
drinks.continent.head() # There the index for the series data come from the dataframe.

0      Asia
1    Europe
2    Africa
3    Europe
4    Africa
Name: continent, dtype: object

In [24]:
drinks.set_index('country', inplace=True) # Here we are using the country as the index, and setting it.
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

In [26]:
drinks.continent.head() # What we get is a series data with country as the index and continent as the value.

country
Afghanistan      Asia
Albania        Europe
Algeria        Africa
Andorra        Europe
Angola         Africa
Name: continent, dtype: object

In [28]:
drinks.continent.value_counts() # This is series data.

continent
Africa           53
Europe           45
Asia             44
North America    23
Oceania          16
South America    12
Name: count, dtype: int64

In [30]:
drinks.continent.value_counts().index

Index(['Africa', 'Europe', 'Asia', 'North America', 'Oceania',
       'South America'],
      dtype='object', name='continent')

In [31]:
drinks.continent.value_counts().values

array([53, 45, 44, 23, 16, 12])

In [35]:
# Using the index we can select the value
drinks.continent.value_counts()['Europe'] # From index Europe what is the value. This is similar to what loc
# does in case of a dataframe. The reason it worked, is because this is a series object.

45

In [37]:
# Sorting of series data.
drinks.continent.value_counts().sort_values() # This will sort in ascending order in itself.

continent
South America    12
Oceania          16
North America    23
Asia             44
Europe           45
Africa           53
Name: count, dtype: int64

In [39]:
drinks.continent.value_counts().sort_index() # Here we are sorting using the index

continent
Africa           53
Asia             44
Europe           45
North America    23
Oceania          16
South America    12
Name: count, dtype: int64

In [41]:
people = pd.Series([3000000, 85000], index=['Albania', 'Andorra'], name='population')
people

Albania    3000000
Andorra      85000
Name: population, dtype: int64

Now using the information above related to the population, if you want to calculate the total number of beer serving. you can simply do beer_serving * people

In [42]:
drinks.beer_servings * people # Here pandas first finds the index in our case Albania and Andorra and then does the multiplication.

Afghanistan            NaN
Albania        267000000.0
Algeria                NaN
Andorra         20825000.0
Angola                 NaN
                  ...
Venezuela              NaN
Vietnam                NaN
Yemen                  NaN
Zambia                 NaN
Zimbabwe               NaN
Length: 193, dtype: float64

Now, if I want to add this people data series, how can I add to the data frame.

In [45]:
pd.concat([drinks, people], axis=1).head()# Concat method can be used to add rows on top of other rows, and add columns along the side of other columns or next to the columns, and this is controlled by the access parameter. Using axis 1 we are adding the people column at the end.

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,population
Afghanistan,0,0,0,0.0,Asia,NaN
Albania,89,132,54,4.9,Europe,3000000.0
Algeria,25,0,14,0.7,Africa,NaN
Andorra,245,138,312,12.4,Europe,85000.0
Angola,217,57,45,5.9,Africa,NaN